# 전자제조데이터분석 과제 02
## 제출: eclass 과제메뉴 02
- 각 코드 블럭의 출력 결과까지 저장하여 제출해주세요.
- 최대한 본인의 힘으로 해결하세요. (중간고사과 유사한 스타일)
- 각 코드의 동작방식을 반드시! 주석으로 설명해주세요.
- ipynb 파일을 그대로 제출해주세요.

##기한: 2021.10.23 23:59

학번: _________________________
이름: _________________________

참고해야 할 문서: Padnas API Reference 

https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/index.html

팁:
- read_csv(): csv 파일을 읽기 위한 메소드 (https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/api/pandas.read_csv.html#pandas.read_csv)
- dataframe.*: dataframe을 다루기 위한 다양한 메소드 (https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/frame.html)



### Step 1. pandas 모듈을 import 하세요.

### Step 2. 제공된 데이터 파일을 업로드하세요.

### Step 3. 업로드한 파일을 읽어 dataframe을 추출한 후 (pd.read_csv() 활용), 특정 변수에 저장하세요. 이때, 'user_id' 열을 dataframe의 인덱스로 활용하세요.

### Step 4. 첫 25개 항목을 출력하세요.

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. 마지막 10개 항목을 출력하세요.

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. 데이터 파일에 총 몇개의 항목이 존재하는지 구해보세요.

943

### Step 7. Dataframe에 몇 개의 열(column)이 존재하나요?

4

### Step 8. Dataframe 내 모든 열(column)의 이름을 출력해보세요.

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. Dataframe의 인덱싱이 어떻게 되어있는지 출력해보세요.

In [ ]:
# "the index" (aka "the labels")

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. 각 열(column)의 data type을 출력해보세요.

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. occupation 열(column)만 출력해보세요.

user_id
1         technician
2              other
3             writer
4         technician
5              other
6          executive
7      administrator
8      administrator
9            student
10            lawyer
11             other
12             other
13          educator
14         scientist
15          educator
16     entertainment
17        programmer
18             other
19         librarian
20         homemaker
21            writer
22            writer
23            artist
24            artist
25          engineer
26          engineer
27         librarian
28            writer
29        programmer
30           student
           ...
914            other
915    entertainment
916         engineer
917          student
918        scientist
919            other
920           artist
921          student
922    administrator
923          student
924            other
925         salesman
926    entertainment
927       programmer
928          student
929        scientist
930        scientist
931         educator
932         educator
933          student
934         engineer
935           doctor
936            other
937         educator
938       technician
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. 데이터 파일에 몇 개의 서로 다른 occupation이 존재하나요?

21

### Step 13. 가장 많이 등장하는 occupation은 무엇인가요?

'student'

### Step 14. Dataframe내 모든 열(column)에 대하여 다양한 통계정보를 출력해보세요.

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 15. 사용자들의 평균 나이는 몇살인가요?

34

### Step 16. 가장 적게 등장한 사용자들 중 최연소자의 나이는 몇인가요?

7